In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
%matplotlib inline

# Reading in Population by County - 2020

In [2]:
county_pop = pd.read_csv('../data/pop_county.csv')
county_pop.head()

              CTYNAME  pop2020  GrowthRate
0      Shelby, County   935346      0.7430
1    Davidson, County   699749     11.4688
2        Knox, County   474003      9.4829
3    Hamilton, County   370594      9.8965
4  Rutherford, County   341316     29.4325

In [3]:
county_pop = county_pop[['CTYNAME', 'pop2020']]
county_pop.head()

              CTYNAME  pop2020
0      Shelby, County   935346
1    Davidson, County   699749
2        Knox, County   474003
3    Hamilton, County   370594
4  Rutherford, County   341316

In [4]:
county_pop.columns = ['county', 'population']
county_pop.head()

               county  population
0      Shelby, County      935346
1    Davidson, County      699749
2        Knox, County      474003
3    Hamilton, County      370594
4  Rutherford, County      341316

In [5]:
county_pop['county'] = county_pop['county'].str.split(',').apply(lambda x: str(x[0]))
county_pop.head()

       county  population
0      Shelby      935346
1    Davidson      699749
2        Knox      474003
3    Hamilton      370594
4  Rutherford      341316

In [6]:
county_pop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 95 entries, 0 to 94
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   county      95 non-null     object
 1   population  95 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.6+ KB

In [7]:
county_pop.shape

(95, 2)

# Reading in Income Per Capita by County - 2016

In [8]:
ipc_county = pd.read_csv('../data/income_pc_county.csv')
ipc_county.head()

   Year    County    Value LastReportedDate
0  2011  Anderson  35932.0       10/23/2018
1  2011   Bedford  29258.0       10/23/2018
2  2011    Benton  30373.0       10/23/2018
3  2011   Bledsoe  20002.0       10/23/2018
4  2011    Blount  33636.0       10/23/2018

In [9]:
ipc_county = ipc_county [['Year', 'County', 'Value']]
ipc_county.head()

   Year    County    Value
0  2011  Anderson  35932.0
1  2011   Bedford  29258.0
2  2011    Benton  30373.0
3  2011   Bledsoe  20002.0
4  2011    Blount  33636.0

In [10]:
ipc_county.columns = ['year', 'county', 'income']
ipc_county.head()

   year    county   income
0  2011  Anderson  35932.0
1  2011   Bedford  29258.0
2  2011    Benton  30373.0
3  2011   Bledsoe  20002.0
4  2011    Blount  33636.0

In [11]:
ipc_county.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 577 entries, 0 to 576
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    577 non-null    object
 1   county  576 non-null    object
 2   income  576 non-null    float64
dtypes: float64(1), object(2)
memory usage: 13.6+ KB

In [12]:
ipc_county.shape

(577, 3)

In [13]:
ipc_county = ipc_county.loc[ipc_county['year'].isin(["2016"])]
print(ipc_county.head())
print('---------')
print(ipc_county['year'].value_counts())

     year    county   income
480  2016  Anderson  39225.0
481  2016   Bedford  34069.0
482  2016    Benton  34013.0
483  2016   Bledsoe  20353.0
484  2016    Blount  39226.0
---------
2016    96
Name: year, dtype: int64

# Reading in Traffic Volume Data - 2018

In [14]:
traffic_volume_county = pd.read_csv('../data/traffic_data_county.csv')
traffic_volume_county.head()

,OBJECTID,Station ID,Station Number,County,Location,Route Number,2018,2017,2016,2015,...,1992,1991,1990,1989,1988,1987,1986,1985,1984,1983
0,523,5000001,1,Benton,NEAR HENRY CO LINE,895,64,103.0,152.0,149.0,...,60.0,130.0,140.0,122.0,145.0,123.0,141.0,NaN,NaN,NaN
1,524,7000001,1,Bledsoe,NORTH OF BELLVIEW,SR101,1622,1486.0,1617.0,1408.0,...,1104.0,787.0,878.0,960.0,1074.0,818.0,762.0,672.0,NaN,NaN
2,525,9000001,1,Blount,NEAR SEVIER COUNTY LINE,1275,5704,4238.0,3771.0,3589.0,...,2150.0,2190.0,1920.0,2201.0,2004.0,1733.0,1356.0,1584.0,NaN,NaN
3,526,11000001,1,Bradley,N OF EUREKA E OF MEIGS CO LINE,SR306,3478,2458.0,2654.0,2670.0,...,1423.0,1372.0,1606.0,1458.0,1381.0,1262.0,1205.0,1128.0,NaN,NaN
4,527,13000001,1,Campbell,SOUTHWEST JELLICO,SR297,2956,3222.0,3035.0,2858.0,...,3200.0,3245.0,3332.0,3650.0,3197.0,3454.0,2841.0,2794.0,NaN,NaN

In [15]:
traffic_volume_county.columns

Index(['OBJECTID', 'Station ID', 'Station Number', 'County', 'Location',
       'Route Number', '2018', '2017', '2016', '2015', '2014', '2013', '2012',
       '2011', '2010', '2009', '2008', '2007', '2006', '2005', '2004', '2003',
       '2002', '2001', '2000', '1999', '1998', '1997', '1996', '1995', '1994',
       '1993', '1992', '1991', '1990', '1989', '1988', '1987', '1986', '1985',
       '1984', '1983'],
      dtype='object')

In [16]:
traffic_volume_county = traffic_volume_county[['County', 'Location', '2018']]
traffic_volume_county.head()

     County                        Location  2018
0    Benton              NEAR HENRY CO LINE    64
1   Bledsoe               NORTH OF BELLVIEW  1622
2    Blount         NEAR SEVIER COUNTY LINE  5704
3   Bradley  N OF EUREKA E OF MEIGS CO LINE  3478
4  Campbell               SOUTHWEST JELLICO  2956

In [17]:
traffic_volume_county.columns = ['county', 'location', 'traffic_volume']
traffic_volume_county.head()

     county                        location  traffic_volume
0    Benton              NEAR HENRY CO LINE              64
1   Bledsoe               NORTH OF BELLVIEW            1622
2    Blount         NEAR SEVIER COUNTY LINE            5704
3   Bradley  N OF EUREKA E OF MEIGS CO LINE            3478
4  Campbell               SOUTHWEST JELLICO            2956

In [18]:
traffic_volume_county.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11176 entries, 0 to 11175
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   county          11176 non-null  object
 1   location        11167 non-null  object
 2   traffic_volume  11176 non-null  int64
dtypes: int64(1), object(2)
memory usage: 262.1+ KB

In [19]:
traffic_volume_county.shape

(11176, 3)

In [20]:
traffic_volume_county = traffic_volume_county.groupby(['county']).agg({'traffic_volume': "sum"}).reset_index()
traffic_volume_county.shape

(95, 2)

In [21]:
traffic_volume_county.head()

     county  traffic_volume
0  Anderson         1002631
1   Bedford          492738
2    Benton          205242
3   Bledsoe           54175
4    Blount         1710630